//Переглянемо наступний код:

//const birthday = '18.04.1982';

//const age = someCode(birthday);

//В нас є константа birthday для дати, а також константа age.

//Константа age обчислюється від birthday за допомогою someCode(), що означає виклик функції, яку ми ще не розібрали (ми скоро це зробимо!), але деталі тут не мають значення, річ у тім, що age обчислюється якимось чином на основі birthday.

//Чи можна використовувати великі букви для імені birthday? А для age? Чи для обох змінних?

//const BIRTHDAY = '18.04.1982'; // використовувати великі букви?

//const AGE = someCode(BIRTHDAY); // а тут?


//Відповідь: 
// const BIRTHDAY може бути написана капсом так як їй вже присвоїне постійне значення
// const AGE не може бути визначена капсом так як результат може змінюатися з плином часу