"use strict";
//Яке останнє значення буде виведено на екран? Чому?
//Остання виведена цифра буде 1
let digit = 3;
while (digit) {
    console.log(digit--);
}
//Запишіть для кожного циклу значення, які він виведе. Потім порівняйте з відповіддю.
//Чи виводять обидва цикли однакові значення?
// Префіксна форма ++i:
let ii = 0;
while (++ii < 5)
    console.log(ii); //2, 3, 4
//Постфіксна форма i++
let digit1 = 0;
while (digit1++ < 5)
    console.log(digit1); //1,2,3,4,5
//Яке значення виведе цикл "for"?
//Для кожного циклу запишіть, які значення він виведе. Потім порівняйте з відповіддю.
// Обидва цикли виведуть одинакові числа чи ні?
//Постфіксна форма:
for (let i = 0; i < 5; i++)
    console.log(i); //0,1,2,3,4
//Префіксна форма:
for (let i = 0; i < 5; ++i)
    console.log(i); //0,1,2,3,4
//Виведіть парні числа
//Виведіть парні числа від 2 до 10, використовуючи цикл for.
for (let i = 0; i <= 10; i++) {
    if (i % 2 == 0) {
        console.log(i);
    }
}
//Замініть цикл "for" на "while"
//for (let i = 0; i < 3; i++) {
//   alert( `число ${i}!` );
// }
let p = 0;
while (p < 3) {
    console.log(`число ${p}!`);
    p++;
}
//Повторяти цикл, доки ввід не вірний
//Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.
//
// Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.
//
// Ми припускаємо, що відвідувач вводитиме лише числа. В цьому завданні не обов’язково реалізовувати оброблення нечислового введення.
let typedNmb;
do {
    typedNmb = prompt("Type digit more than 100");
    typedNmb = Number(typedNmb);
} while (typedNmb <= 100);
//Вивести прості числа
//Просте число – це натуральне число, яке має два дільники (1 і саме число).
//
// Інакше кажучи, n > 1 – просте, якщо воно більше за 1 і ділиться без остачі на 1 та n.
//
// Наприклад, число 5 – просте, тому що воно не ділиться без остачі на 2, 3 і 4. Воно ділиться без остачі лише на 1 і на 5.
//
// Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.
//
// Для n = 10 результат повинен бути 2,3,5,7.
//
// P.S. Код також повинен легко модифікуватися для будь-якого числа n.
let typedNumber = 10; // Задаємо значення кінця діапазону чисел
for (let i = 2; i <= typedNumber; i++) {
    let isPrime = true;
    for (let j = 2; j < i; j++) {
        if (i % j == 0) {
            isPrime = false; // Якщо число ділиться на j, то воно не просте
            break; // Якщо знайшли дільник, зупиняємо перевірку
        }
    }
    if (isPrime) {
        console.log(i); // Вивід отриманих простих чисел
    }
}
